test/data/with_fries.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<jsconf xmlns="http://example.com/ns1">
			<response xmlns:ab="http://example.com/ns2">
				<meta>
					<component id="seite1" class="component">
						<properties xmlns:cd="http://example.com/ns3">
							<property name="prop1">
								<thing />
								<value>1</value>
							</property>
							<property name="prop2">
								<thing att="something" />
							</property>
							<foo_bar>foo</foo_bar>
						</properties>
					</component>
				</meta>
			</response>
		</jsconf>
	</soap:Body>
</soap:Envelope>
